In [41]:
print(my_dictionary)

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'], 'age': [35, 100, 60, 50, 76], 'salary': [400, 500, 600, 650, 75000]}

In [42]:
my_dictionary= {
    "name":["person 1","person 2","person 3","person 4","person 5"],
    "age":[35,100,60,50,76],
    "salary":[400,500,600,650,75000],
    "location":["Mombasa","Nairobi","Kisumu","Nakuru","Kericho"],
}

In [43]:
print(my_dictionary)

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'], 'age': [35, 100, 60, 50, 76], 'salary': [400, 500, 600, 650, 75000], 'location': ['Mombasa', 'Nairobi', 'Kisumu', 'Nakuru', 'Kericho']}

In [7]:
print(my_dictionary)

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'], 'age': [35, 100, 60, 50, 76], 'salary': [400, 500, 600.65, 75000]}

In [37]:
for key, value in my_dictionary.items():
    print(key, value)

name ['person 1', 'person 2', 'person 3', 'person 4', 'person 5']
age [35, 100, 60, 50, 76]
salary [400, 500, 600, 650, 75000]

In [44]:
del my_dictionary["location"]

In [45]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 60, 50, 76],
 'salary': [400, 500, 600, 650, 75000]}

In [30]:
import pandas as pd

In [48]:
my_dictionary

{'name': ['person 1', 'person 2', 'person 3', 'person 4', 'person 5'],
 'age': [35, 100, 60, 50, 76],
 'salary': [400, 500, 600, 650, 75000]}

In [46]:
df=pd.DataFrame(my_dictionary)

In [47]:
df

       name  age  salary
0  person 1   35     400
1  person 2  100     500
2  person 3   60     600
3  person 4   50     650
4  person 5   76   75000

In [49]:
df[["name","age"]]

       name  age
0  person 1   35
1  person 2  100
2  person 3   60
3  person 4   50
4  person 5   76

In [51]:
df["age"]+1

0     36
1    101
2     61
3     51
4     77
Name: age, dtype: int64

In [52]:
df.dtypes

name      object
age        int64
salary     int64
dtype: object

In [55]:
df["age"] = df["age"]+1

In [56]:
df

       name  age  salary
0  person 1   36     400
1  person 2  101     500
2  person 3   61     600
3  person 4   51     650
4  person 5   77   75000

In [71]:
df["age"],df["salary"]=df["age"]+1, df["salary"]+500

In [72]:
df

       name  age  salary
0  person 1   38    2900
1  person 2  103    3000
2  person 3   63    3100
3  person 4   53    3150
4  person 5   79   77500

In [60]:
df["salary"]+500

0     2400
1     2500
2     2600
3     2650
4    77000
Name: salary, dtype: int64

In [64]:
my_dictionary = {
    "name":["Violet","Mary","James"],
    "age":[30,45,28],
    "salary":[35000,40000,30000],
    "target":[3.5,4.5,3.0],
}

In [65]:
print(my_dictionary)

{'name': ['Violet', 'Mary', 'James'], 'age': [30, 45, 28], 'salary': [35000, 40000, 30000], 'target': [3.5, 4.5, 3.0]}

In [69]:
for key,value in my_dictionary.items():
    print(key,value)

name ['Violet', 'Mary', 'James']
age [30, 45, 28]
salary [35000, 40000, 30000]
target [3.5, 4.5, 3.0]

In [74]:
df["age"],df["salary"] = df["age"]+1, df["salary"]+500

In [75]:
df

       name  age  salary
0  person 1   39    3400
1  person 2  104    3500
2  person 3   64    3600
3  person 4   54    3650
4  person 5   80   78000